# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Cat clone with syntax highlighting, used by fzf previews
brew "bat"
# Cross-platform make
brew "cmake"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Lua language server
brew "lua-language-server"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Access X11 clipboards from the command-line
brew "xclip"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Cross-shell prompt for astronauts
brew "starship"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# Object-relational database system
brew "postgresql@14"
# Command-line interface for SQLite
brew "sqlite"
# Opinionated Lua code formatter
brew "stylua"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern, maintained replacement for ls
brew "eza"
# A better cd command
brew "zoxide"
# Simple terminal UI for git commands
brew "lazygit"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker-desktop"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Grammarly for desktop
cask "grammarly-desktop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Music streaming service
cask "spotify"
# Keyboard customizer
cask "karabiner-elements"
# Move and resize windows with keyboard shortcuts
cask "rectangle"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# App that enables mouse-free UI interaction
cask "shortcat"
# Software for Logitech devices
cask "logi-options+"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "mtxr.sqltools"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "ZainChen.json"
vscode "zhuangtongfa.material-theme"
